name: "SegNet-Multiscale-x3"
layer {
  name: "data-train"
  type: "Data"
  top: "_image"
  include {
    phase: TRAIN
  }
    data_param {
    source: "/mnt/data1/_Dimitris/_Research/00_Data/01_Vaihingen_data_ISPRS/01_Image_Data/01_train/256-image-2-lmdb"
    batch_size: 2
    backend: LMDB
  }
  transform_param {
    scale: 0.00390625
  }
}

layer {
  name: "data-train"
  type: "Data"
  top: "_dsm"
  include {
    phase: TRAIN
  }
    data_param {
    source: "/mnt/data1/_Dimitris/_Research/00_Data/01_Vaihingen_data_ISPRS/02_DEM_Data/01_DSM/01_train/256-dsm-lmdb-2" 
    batch_size: 2
    backend: LMDB
  }
  transform_param {
    scale: 0.003333333
  }
}

layer {
  name: "data-train"
  type: "Data"
  top: "_ndsm"
  include {
    phase: TRAIN
  }
    data_param {
    source : "/mnt/data1/_Dimitris/_Research/00_Data/01_Vaihingen_data_ISPRS/02_DEM_Data/02_nDSM/01_train/256-ndsm-lmdb-2"
    batch_size: 2
    backend: LMDB
  }
  transform_param {
    scale: 0.003333333
  }
}


layer {
  name: "data-train"
  type: "Data"
  top: "_label"
  include {
    phase: TRAIN
  }
    data_param {
    source: "/mnt/data1/_Dimitris/_Research/00_Data/01_Vaihingen_data_ISPRS/03_Annotation_Labels/01_train/256-label-data-2"
    batch_size: 2
    backend: LMDB
  }  
}

layer {
  name: "data-train"
  type: "Data"
  top: "_edge-label"
  include {
    phase: TRAIN
  }
  data_param {
    source: "/mnt/data1/_Dimitris/_Research/00_Data/01_Vaihingen_data_ISPRS/04_Edge_Labels/01_train/256-edge-label-2"
    batch_size: 2
    backend: LMDB
  }
}


# ====================== VAL DATA ====================== #

layer {
  name: "data-train"
  type: "Data"
  top: "_image"
  include {
    phase: TEST 
  }
    data_param {
    source: "/mnt/data1/_Dimitris/00_Data/01_Vaihingen_data_ISPRS/01_Image_Data/02_val/02_size_256/_256-multiresolution-image-lmdb/"
    batch_size: 2
    backend: LMDB
  }
  transform_param {
    scale: 0.00390625
  }
}

layer {
  name: "data-train"
  type: "Data"
  top: "_dsm"
  include {
    phase: TEST 
  }
    data_param {
    source: "/mnt/data1/_Dimitris/00_Data/01_Vaihingen_data_ISPRS/02_DEM_Data/01_DSM/02_size_256/02_val/"
    batch_size: 2
    backend: LMDB
  }
  transform_param {
    scale: 0.003333333
  }
}

layer {
  name: "data-train"
  type: "Data"
  top: "_ndsm"
  include {
    phase: TEST 
  }
    data_param {
    source: "/mnt/data1/_Dimitris/00_Data/01_Vaihingen_data_ISPRS/02_DEM_Data/02_nDSM/02_val/nDSM-lmdb/02_size_256/"
    batch_size: 2
    backend: LMDB
  }
  transform_param {
    scale: 0.003333333
  }
}

layer {
  name: "data-train"
  type: "Data"
  top: "_label"
  include {
    phase: TEST 
  }
    data_param {
    source: "/mnt/data1/_Dimitris/00_Data/01_Vaihingen_data_ISPRS/03_Annotation_Labels/01_size_256/02_val/_256-label-data/"
    batch_size: 2
    backend: LMDB
  }
}

layer {
  name: "data-val"
  type: "Data"
  top: "_edge-label"
  include {
    phase: TEST 
  }
  data_param {
    source: "/mnt/data1/_Dimitris/00_Data/01_Vaihingen_data_ISPRS/04_Edge_Labels/01_Dilated_2pix_srtel/01_size_256/02_val/01_dilated_strel_2pix/_256-edge-label-data/"
    batch_size: 2
    backend: LMDB
  }
}


############################# Concatenate all input data   ######################################

layer {
  name: "data-componets"
  type: "Concat"
  bottom: "_image"
  bottom: "_dsm"
  bottom: "_ndsm"
  bottom: "_label"
    bottom: "_edge-label"
  top: "_data"
}

# ==========================  STOCHASTIC AUGMENTATION ================================ #                                            
                                                                                                                                    
layer {                                                                                                                             
    name: "data_augmentation"                                                                                                       
    type: "Python"                                                                                                                  
    bottom: "_data"                                                                                                                 
    top: "_data"                                                                                                                    
    python_param {                                                                                                                  
        module: "layer_data_augmentator"                                                                                            
        layer: "RealtimeDataAugmentation"                                                                                           
    }                                                                                                                               
    include {                                                                                                                       
        phase: TRAIN                                                                                                                
     }                                                                                                                              
 }         

# ======================== SEPARATE CONCATENATED LAYERS =============================== #                                                                                                                                                                         
layer {                                                                                                                             
  name: "data_slicer"                                                                                                               
  type: "Slice"                                                                                                                     
  bottom: "_data"                                                                                                                   
  top: "image"                                                                                                                      
  top: "dsm"                                                                                                                        
  top: "ndsm"                                                                                                                       
  top: "label"                                                                                                                      
  top: "edge-label"                                                                                                              
  slice_param {                                                                                                                     
    axis: 1                                                                                                                         
    slice_point: 3                                                                                                                  
    slice_point: 4                                                                                                                  
    slice_point: 5                                                                                                                  
    slice_point: 6                                                                                                                  
  }                                                                                                                                 
}   

############################# Concatenate nDSM and DSM   ##############################

layer {
  name: "dem-componets"
  type: "Concat"
  bottom: "dsm"
  bottom: "ndsm"
  top: "dem"
}

################## Edge Model Inference #######################

layer {
  name: "edge_dem_conv1_1_"
  type: "Convolution"
  bottom: "dem"
  top: "ee_dem_conv1_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 35
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}

layer {
  name: "edge_conv1_1"
  type: "Convolution"
  bottom: "image"
  top: "ee_data_conv1_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 35
    kernel_size: 3
    engine: CUDNN
  }
}
layer {
  name: "data_relu1_1"
  type: "ReLU"
  bottom: "ee_data_conv1_1"
  top: "ee_data_conv1_1"
}
layer {
  name: "dem_relu1_1"
  type: "ReLU"
  bottom: "ee_dem_conv1_1"
  top: "ee_dem_conv1_1"
}
layer {
  name: "edge_conv1_2"
  type: "Convolution"
  bottom: "ee_data_conv1_1"
  top: "ee_data_conv1_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    engine: CUDNN
  }
}
layer {
  name: "edge_dem_conv1_2_"
  type: "Convolution"
  bottom: "ee_dem_conv1_1"
  top: "ee_dem_conv1_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "data_relu1_2"
  type: "ReLU"
  bottom: "ee_data_conv1_2"
  top: "ee_data_conv1_2"
}
layer {
  name: "dem_relu1_2"
  type: "ReLU"
  bottom: "ee_dem_conv1_2"
  top: "ee_dem_conv1_2"
}
layer {
  name: "data_pool1"
  type: "Pooling"
  bottom: "ee_data_conv1_2"
  top: "ee_data_pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "dem_pool1"
  type: "Pooling"
  bottom: "ee_dem_conv1_2"
  top: "ee_dem_pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "edge_conv2_1"
  type: "Convolution"
  bottom: "ee_data_pool1"
  top: "ee_data_conv2_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    engine: CUDNN
  }
}
layer {
  name: "edge_dem_conv2_1_"
  type: "Convolution"
  bottom: "ee_dem_pool1"
  top: "ee_dem_conv2_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "data_relu2_1"
  type: "ReLU"
  bottom: "ee_data_conv2_1"
  top: "ee_data_conv2_1"
}
layer {
  name: "dem_relu2_1"
  type: "ReLU"
  bottom: "ee_dem_conv2_1"
  top: "ee_dem_conv2_1"
}
layer {
  name: "edge_conv2_2"
  type: "Convolution"
  bottom: "ee_data_conv2_1"
  top: "ee_data_conv2_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    engine: CUDNN
  }
}
layer {
  name: "edge_dem_conv2_2_"
  type: "Convolution"
  bottom: "ee_dem_conv2_1"
  top: "ee_dem_conv2_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "data_relu2_2"
  type: "ReLU"
  bottom: "ee_data_conv2_2"
  top: "ee_data_conv2_2"
}
layer {
  name: "dem_relu2_2"
  type: "ReLU"
  bottom: "ee_dem_conv2_2"
  top: "ee_dem_conv2_2"
}
layer {
  name: "data_pool2"
  type: "Pooling"
  bottom: "ee_data_conv2_2"
  top: "ee_data_pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "dem_pool2"
  type: "Pooling"
  bottom: "ee_dem_conv2_2"
  top: "ee_dem_pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "edge_conv3_1"
  type: "Convolution"
  bottom: "ee_data_pool2"
  top: "ee_data_conv3_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    engine: CUDNN
  }
}
layer {
  name: "edge_dem_conv3_1_"
  type: "Convolution"
  bottom: "ee_dem_pool2"
  top: "ee_dem_conv3_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "data_relu3_1"
  type: "ReLU"
  bottom: "ee_data_conv3_1"
  top: "ee_data_conv3_1"
}
layer {
  name: "dem_relu3_1"
  type: "ReLU"
  bottom: "ee_dem_conv3_1"
  top: "ee_dem_conv3_1"
}
layer {
  name: "edge_conv3_2"
  type: "Convolution"
  bottom: "ee_data_conv3_1"
  top: "ee_data_conv3_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    engine: CUDNN
  }
}
layer {
  name: "edge_dem_conv3_2_"
  type: "Convolution"
  bottom: "ee_dem_conv3_1"
  top: "ee_dem_conv3_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "data_relu3_2"
  type: "ReLU"
  bottom: "ee_data_conv3_2"
  top: "ee_data_conv3_2"
}
layer {
  name: "dem_relu3_2"
  type: "ReLU"
  bottom: "ee_dem_conv3_2"
  top: "ee_dem_conv3_2"
}
layer {
  name: "edge_conv3_3"
  type: "Convolution"
  bottom: "ee_data_conv3_2"
  top: "ee_data_conv3_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    engine: CUDNN
  }
}
layer {
  name: "edge_dem_conv3_3_"
  type: "Convolution"
  bottom: "ee_dem_conv3_2"
  top: "ee_dem_conv3_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "data_relu3_3"
  type: "ReLU"
  bottom: "ee_data_conv3_3"
  top: "ee_data_conv3_3"
}
layer {
  name: "dem_relu3_3"
  type: "ReLU"
  bottom: "ee_dem_conv3_3"
  top: "ee_dem_conv3_3"
}
layer {
  name: "data_pool3"
  type: "Pooling"
  bottom: "ee_data_conv3_3"
  top: "ee_data_pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "dem_pool3"
  type: "Pooling"
  bottom: "ee_dem_conv3_3"
  top: "ee_dem_pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "edge_conv4_1"
  type: "Convolution"
  bottom: "ee_data_pool3"
  top: "ee_data_conv4_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    engine: CUDNN
  }
}
layer {
  name: "edge_dem_conv4_1_"
  type: "Convolution"
  bottom: "ee_dem_pool3"
  top: "ee_dem_conv4_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "data_relu4_1"
  type: "ReLU"
  bottom: "ee_data_conv4_1"
  top: "ee_data_conv4_1"
}
layer {
  name: "dem_relu4_1"
  type: "ReLU"
  bottom: "ee_dem_conv4_1"
  top: "ee_dem_conv4_1"
}
layer {
  name: "edge_conv4_2"
  type: "Convolution"
  bottom: "ee_data_conv4_1"
  top: "ee_data_conv4_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    engine: CUDNN
  }
}
layer {
  name: "edge_dem_conv4_2_"
  type: "Convolution"
  bottom: "ee_dem_conv4_1"
  top: "ee_dem_conv4_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "data_relu4_2"
  type: "ReLU"
  bottom: "ee_data_conv4_2"
  top: "ee_data_conv4_2"
}
layer {
  name: "dem_relu4_2"
  type: "ReLU"
  bottom: "ee_dem_conv4_2"
  top: "ee_dem_conv4_2"
}
layer {
  name: "edge_conv4_3"
  type: "Convolution"
  bottom: "ee_data_conv4_2"
  top: "ee_data_conv4_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    engine: CUDNN
  }
}
layer {
  name: "edge_dem_conv4_3_"
  type: "Convolution"
  bottom: "ee_dem_conv4_2"
  top: "ee_dem_conv4_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "data_relu4_3"
  type: "ReLU"
  bottom: "ee_data_conv4_3"
  top: "ee_data_conv4_3"
}
layer {
  name: "dem_relu4_3"
  type: "ReLU"
  bottom: "ee_dem_conv4_3"
  top: "ee_dem_conv4_3"
}
layer {
  name: "data_pool4"
  type: "Pooling"
  bottom: "ee_data_conv4_3"
  top: "ee_data_pool4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "dem_pool4"
  type: "Pooling"
  bottom: "ee_dem_conv4_3"
  top: "ee_dem_pool4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "edge_conv5_1"
  type: "Convolution"
  bottom: "ee_data_pool4"
  top: "ee_data_conv5_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    engine: CUDNN
  }
}
layer {
  name: "edge_dem_conv5_1_"
  type: "Convolution"
  bottom: "ee_dem_pool4"
  top: "ee_dem_conv5_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "data_relu5_1"
  type: "ReLU"
  bottom: "ee_data_conv5_1"
  top: "ee_data_conv5_1"
}
layer {
  name: "dem_relu5_1"
  type: "ReLU"
  bottom: "ee_dem_conv5_1"
  top: "ee_dem_conv5_1"
}
layer {
  name: "edge_conv5_2"
  type: "Convolution"
  bottom: "ee_data_conv5_1"
  top: "ee_data_conv5_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    engine: CUDNN
  }
}
layer {
  name: "edge_dem_conv5_2_"
  type: "Convolution"
  bottom: "ee_dem_conv5_1"
  top: "ee_dem_conv5_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "data_relu5_2"
  type: "ReLU"
  bottom: "ee_data_conv5_2"
  top: "ee_data_conv5_2"
}
layer {
  name: "dem_relu5_2"
  type: "ReLU"
  bottom: "ee_dem_conv5_2"
  top: "ee_dem_conv5_2"
}
layer {
  name: "edge_conv5_3"
  type: "Convolution"
  bottom: "ee_data_conv5_2"
  top: "ee_data_conv5_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    engine: CUDNN
  }
}
layer {
  name: "edge_dem_conv5_3_"
  type: "Convolution"
  bottom: "ee_dem_conv5_2"
  top: "ee_dem_conv5_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "data_relu5_3"
  type: "ReLU"
  bottom: "ee_data_conv5_3"
  top: "ee_data_conv5_3"
}
layer {
  name: "dem_relu5_3"
  type: "ReLU"
  bottom: "ee_dem_conv5_3"
  top: "ee_dem_conv5_3"
}

################## DSN-1 ####################

layer {
  name: "dsn-1-fuse"
  type: "Concat"
  bottom: "ee_data_conv1_2"
  bottom: "ee_dem_conv1_2"
  top: "score-dsn1-merge"
  concat_param {
    concat_dim: 1
  }
}
layer {
  name: "edge_score-dsn1"
  type: "Convolution"
  bottom: "score-dsn1-merge"
  top: "score-dsn1_"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    
    engine: CUDNN
  }
}

layer {
  name: "edge_crop_dsn1"
  type: "Deconvolution"
  bottom: "score-dsn1_"
  top: "score-dsn1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    stride: 1
    pad: 34
  }
}

layer { name: "loss-dns1"   type: "EuclideanLoss" bottom: "score-dsn1" bottom: "edge-label" top: "dsn1_loss" loss_weight: 1 }

#################### DSN-2 #################### 

layer {
  name: "dsn-2-fuse"
  type: "Concat"
  bottom: "ee_data_conv2_2"
  bottom: "ee_dem_conv2_2"
  top: "score-dsn2-merge"
  concat_param {
    concat_dim: 1
  }
}
layer {
  name: "edge_score-dsn2"
  type: "Convolution"
  bottom: "score-dsn2-merge"
  top: "score-dsn2_"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    engine: CUDNN
  }
}
layer {
  name: "edge_upsample_2"
  type: "Deconvolution"
  bottom: "score-dsn2_"
  top: "score-dsn2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1
    kernel_size: 4
    stride: 2
    pad: 35
  }
}

layer { name: "loss-dns2" type: "EuclideanLoss" bottom: "score-dsn2" bottom: "edge-label" top: "dsn2_loss" loss_weight: 1}

#################### DSN-3 ####################

layer {
  name: "dsn-3-fuse"
  type: "Concat"
  bottom: "ee_data_conv3_3"
  bottom: "ee_dem_conv3_3"
  top: "score-dsn3-merge"
  concat_param {
    concat_dim: 1
  }
}
layer {
  name: "edge_score-dsn3"
  type: "Convolution"
  bottom: "score-dsn3-merge"
  top: "score-dsn3_"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    engine: CUDNN
  }
}
layer {
  name: "edge_upsample_4"
  type: "Deconvolution"
  bottom: "score-dsn3_"
  top: "score-dsn3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1
    kernel_size: 8
    stride: 4
    pad : 36
  }
}

layer { name: "loss-dns3" type: "EuclideanLoss" bottom: "score-dsn3" bottom: "edge-label" top: "dsn3_loss" loss_weight: 1}


#################### DSN-4 ####################

layer {
  name: "dsn-4-fuse"
  type: "Concat"
  bottom: "ee_data_conv4_3"
  bottom: "ee_dem_conv4_3"
  top: "score-dsn4-merge"
  concat_param {
    concat_dim: 1
  }
}
layer {
  name: "edge_score-dsn4"
  type: "Convolution"
  bottom: "score-dsn4-merge"
  top: "score-dsn4_"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    engine: CUDNN
  }
}
layer {
  name: "edge_upsample_8"
  type: "Deconvolution"
  bottom: "score-dsn4_"
  top: "score-dsn4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1
    kernel_size: 16
    stride: 8
    pad: 40
  }
}

layer { name: "loss-dns4" type: "EuclideanLoss" bottom: "score-dsn4" bottom: "edge-label" top: "dsn4_loss" loss_weight: 1}


#################### DSN-5 ####################

layer {
  name: "dsn-5-fuse"
  type: "Concat"
  bottom: "ee_data_conv5_3"
  bottom: "ee_dem_conv5_3"
  top: "score-dsn5-merge"
  concat_param {
    concat_dim: 1
  }
}
layer {
  name: "edge_score-dsn5"
  type: "Convolution"
  bottom: "score-dsn5-merge"
  top: "score-dsn5_"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    engine: CUDNN
  }
}
layer {
  name: "edge_upsample_16"
  type: "Deconvolution"
  bottom: "score-dsn5_"
  top: "score-dsn5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1
    kernel_size: 32
    stride: 16
    pad: 48
  }
}

layer { name: "loss-dns5" type: "EuclideanLoss" bottom: "score-dsn5"  bottom: "edge-label" top: "dsn5_loss" loss_weight: 1 }


#################### FUSE DSN ####################

layer {
  name: "concat"
  type: "Concat"
  bottom: "score-dsn1"
  bottom: "score-dsn2"
  bottom: "score-dsn3"
  bottom: "score-dsn4"
  bottom: "score-dsn5"
  top: "concat-score"
  concat_param {
    concat_dim: 1
  }
}
layer {
  name: "edge_new-score-weighting"
  type: "Convolution"
  bottom: "concat-score"
  top: "edges"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1
    kernel_size: 1
    engine: CUDNN
  }
}

layer { name: "edge-loss" type: "EuclideanLoss" bottom: "edges" bottom: "edge-label" top: "edge-loss" loss_weight: 1 }



#======================================================================================================
#==================================    ANNOTATION NETWORK ======================================#
#======================================================================================================


############################## Concatenate Edges to Train Data  ###################################

layer {
  name: "image-and-edges"
  type: "Concat"
  bottom: "image"
  bottom: "edges"
  top: "image-and-edges"
}


layer {
  name: "dem-and-edges"
  type: "Concat"
  bottom: "dem"
  bottom: "edges"
  top: "dem-and-edges"
}

#======================================================================================================

layer {
  bottom: "image-and-edges"
  top: "conv1_1_sc1"
  name: "conv1_1_sc1___"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}

layer {
  bottom: "conv1_1_sc1"
  top: "conv1_1_sc1"
  name: "conv1_1_bn_sc1___"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}

layer {
  bottom: "dem-and-edges"
  top: "dem_conv1_1_sc1"
  name: "dem_conv1_1_sc1_"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}

layer {
  bottom: "dem_conv1_1_sc1"
  top: "dem_conv1_1_sc1"
  name: "dem_conv1_1_bn_sc1"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}

#########################

layer {
  bottom: "conv1_1_sc1"
  top: "conv1_1_sc1"
  name: "relu1_1_sc1"
  type: "ReLU"
}

layer {
  bottom: "dem_conv1_1_sc1"
  top: "dem_conv1_1_sc1"
  name: "dem_relu1_1_sc1"
  type: "ReLU"
}

#######################

layer {
  bottom: "conv1_1_sc1"
  top: "conv1_2_sc1"
  name: "conv1_2_sc1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv1_2_sc1"
  top: "conv1_2_sc1"
  name: "conv1_2_bn_sc1"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}

layer {
  bottom: "dem_conv1_1_sc1"
  top: "dem_conv1_2_sc1"
  name: "dem_conv1_2_sc1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}

layer {
  bottom: "dem_conv1_2_sc1"
  top: "dem_conv1_2_sc1"
  name: "dem_conv1_2_bn_sc1"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
  }
}

####################

layer {
  bottom: "conv1_2_sc1"
  top: "conv1_2_sc1"
  name: "relu1_2_sc1"
  type: "ReLU"
}


layer {
  bottom: "dem_conv1_2_sc1"
  top: "dem_conv1_2_sc1"
  name: "dem_relu1_2_sc1"
  type: "ReLU"
}

####################

layer {
  name: "pool1_drop_sc1"
  type: "Dropout"
  bottom: "conv1_2_sc1"
  top: "conv1_2_sc1"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  bottom: "conv1_2_sc1"
  top: "pool1_sc1"
  top: "pool1_mask_sc1"
  name: "pool1_sc1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  name: "dem_pool1_drop_sc1"
  type: "Dropout"
  bottom: "dem_conv1_2_sc1"
  top: "dem_conv1_2_sc1"
  dropout_param {
    dropout_ratio: 0.2
  }
}

layer {
  bottom: "dem_conv1_2_sc1"
  top: "dem_pool1_sc1"
  top: "dem_pool1_mask_sc1"
  name: "dem_pool1_sc1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

######################

layer {
  bottom: "pool1_sc1"
  top: "conv2_1_sc1"
  name: "conv2_1_sc1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv2_1_sc1"
  top: "conv2_1_sc1"
  name: "conv2_1_bn_sc1"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}

layer {
  bottom: "dem_pool1_sc1"
  top: "dem_conv2_1_sc1"
  name: "dem_conv2_1_sc1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "dem_conv2_1_sc1"
  top: "dem_conv2_1_sc1"
  name: "dem_conv2_1_bn_sc1"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}

###############################

layer {
  bottom: "conv2_1_sc1"
  top: "conv2_1_sc1"
  name: "relu2_1_sc1"
  type: "ReLU"
}

layer {
  bottom: "dem_conv2_1_sc1"
  top: "dem_conv2_1_sc1"
  name: "dem_relu2_1_sc1"
  type: "ReLU"
}

#############################

layer {
  bottom: "conv2_1_sc1"
  top: "conv2_2_sc1"
  name: "conv2_2_sc1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}

layer {
  bottom: "conv2_2_sc1"
  top: "conv2_2_sc1"
  name: "conv2_2_bn_sc1"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}

layer {
  bottom: "dem_conv2_1_sc1"
  top: "dem_conv2_2_sc1"
  name: "dem_conv2_2_sc1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "dem_conv2_2_sc1"
  top: "dem_conv2_2_sc1"
  name: "dem_conv2_2_bn_sc1"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
  }
}


#########################

layer {
  bottom: "conv2_2_sc1"
  top: "conv2_2_sc1"
  name: "relu2_2"
  type: "ReLU"
}


layer {
  bottom: "dem_conv2_2_sc1"
  top: "dem_conv2_2_sc1"
  name: "dem_relu2_2"
  type: "ReLU"
}

##########################

layer {
  name: "pool2_drop_sc1"
  type: "Dropout"
  bottom: "conv2_2_sc1"
  top: "conv2_2_sc1"
  dropout_param {
    dropout_ratio: 0.2
  }
}

layer {
  bottom: "conv2_2_sc1"
  top: "pool2_sc1"
  top: "pool2_mask_sc1"
  name: "pool2_sc1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

layer {
  name: "dem_pool2_drop_sc1"
  type: "Dropout"
  bottom: "dem_conv2_2_sc1"
  top: "dem_conv2_2_sc1"
  dropout_param {
    dropout_ratio: 0.2
  }
}

layer {
  bottom: "dem_conv2_2_sc1"
  top: "dem_pool2_sc1"
  top: "dem_pool2_mask_sc1"
  name: "dem_pool2_sc1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

########################

layer {
  bottom: "pool2_sc1"
  top: "conv3_1_sc1"
  name: "conv3_1_sc1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}

layer {
  bottom: "conv3_1_sc1"
  top: "conv3_1_sc1"
  name: "conv3_1_bn_sc1"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}

layer {
  bottom: "dem_pool2_sc1"
  top: "dem_conv3_1_sc1"
  name: "dem_conv3_1_sc1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}

layer {
  bottom: "dem_conv3_1_sc1"
  top: "dem_conv3_1_sc1"
  name: "dem_conv3_1_bn_sc1"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}

############################

layer {
  bottom: "conv3_1_sc1"
  top: "conv3_1_sc1"
  name: "relu3_1_sc1"
  type: "ReLU"
}

layer {
  bottom: "dem_conv3_1_sc1"
  top: "dem_conv3_1_sc1"
  name: "dem_relu3_1_sc1"
  type: "ReLU"
}

###########################

layer {
  bottom: "conv3_1_sc1"
  top: "conv3_2_sc1"
  name: "conv3_2_sc1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}

layer {
  bottom: "conv3_2_sc1"
  top: "conv3_2_sc1"
  name: "conv3_2_bn_sc1"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}

layer {
  bottom: "dem_conv3_1_sc1"
  top: "dem_conv3_2_sc1"
  name: "dem_conv3_2_sc1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}

layer {
  bottom: "dem_conv3_2_sc1"
  top: "dem_conv3_2_sc1"
  name: "dem_conv3_2_bn_sc1"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}

#################################

layer {
  bottom: "conv3_2_sc1"
  top: "conv3_2_sc1"
  name: "relu3_2_sc1"
  type: "ReLU"
}

layer {
  bottom: "dem_conv3_2_sc1"
  top: "dem_conv3_2_sc1"
  name: "dem_relu3_2_sc1"
  type: "ReLU"
}

################################

layer {
  bottom: "conv3_2_sc1"
  top: "conv3_3_sc1"
  name: "conv3_3_sc1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}

layer {
  bottom: "conv3_3_sc1"
  top: "conv3_3_sc1"
  name: "conv3_3_bn_sc1"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}

layer {
  bottom: "dem_conv3_2_sc1"
  top: "dem_conv3_3_sc1"
  name: "dem_conv3_3_sc1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}

layer {
  bottom: "dem_conv3_3_sc1"
  top: "dem_conv3_3_sc1"
  name: "dem_conv3_3_bn_sc1"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}

###########################

layer {
  bottom: "conv3_3_sc1"
  top: "conv3_3_sc1"
  name: "relu3_3_sc1"
  type: "ReLU"
}

layer {
  bottom: "dem_conv3_3_sc1"
  top: "dem_conv3_3_sc1"
  name: "dem_relu3_3_sc1"
  type: "ReLU"
}

#########################

layer {
  name: "pool3_drop_sc1"
  type: "Dropout"
  bottom: "conv3_3_sc1"
  top: "conv3_3_sc1"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  bottom: "conv3_3_sc1"
  top: "pool3_sc1"
  top: "pool3_mask_sc1"
  name: "pool3_sc1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

############################

layer {
  name: "dem_pool3_drop_sc1"
  type: "Dropout"
  bottom: "dem_conv3_3_sc1"
  top: "dem_conv3_3_sc1"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  bottom: "dem_conv3_3_sc1"
  top: "dem_pool3_sc1"
  top: "dem_pool3_mask_sc1"
  name: "dem_pool3_sc1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}

#########################

layer {
  bottom: "pool3_sc1"
  top: "conv4_1_sc1"
  name: "conv4_1_sc1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}

layer {
  bottom: "conv4_1_sc1"
  top: "conv4_1_sc1"
  name: "conv4_1_bn_sc1"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}

layer {
  bottom: "dem_pool3_sc1"
  top: "dem_conv4_1_sc1"
  name: "dem_conv4_1_sc1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}

layer {
  bottom: "dem_conv4_1_sc1"
  top: "dem_conv4_1_sc1"
  name: "dem_conv4_1_bn_sc1"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}


#######################

layer {
  bottom: "conv4_1_sc1"
  top: "conv4_1_sc1"
  name: "relu4_1_sc1"
  type: "ReLU"
}


layer {
  bottom: "dem_conv4_1_sc1"
  top: "dem_conv4_1_sc1"
  name: "dem_relu4_1_sc1"
  type: "ReLU"
}


####################

layer {
  bottom: "conv4_1_sc1"
  top: "conv4_2_sc1"
  name: "conv4_2_sc1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}

layer {
  bottom: "conv4_2_sc1"
  top: "conv4_2_sc1"
  name: "conv4_2_bn_sc1"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}

layer {
  bottom: "dem_conv4_1_sc1"
  top: "dem_conv4_2_sc1"
  name: "dem_conv4_2_sc1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}

layer {
  bottom: "dem_conv4_2_sc1"
  top: "dem_conv4_2_sc1"
  name: "dem_conv4_2_bn_sc1"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}

########################

layer {
  bottom: "conv4_2_sc1"
  top: "conv4_2_sc1"
  name: "relu4_2_sc1"
  type: "ReLU"
}

layer {
  bottom: "dem_conv4_2_sc1"
  top: "dem_conv4_2_sc1"
  name: "relu4_2_sc1"
  type: "ReLU"
}


######################

layer {
  bottom: "conv4_2_sc1"
  top: "conv4_3_sc1"
  name: "conv4_3_sc1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}

layer {
  bottom: "conv4_3_sc1"
  top: "conv4_3_sc1"
  name: "conv4_3_bn_sc1"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}

layer {
  bottom: "dem_conv4_2_sc1"
  top: "dem_conv4_3_sc1"
  name: "dem_conv4_3_sc1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}

layer {
  bottom: "dem_conv4_3_sc1"
  top: "dem_conv4_3_sc1"
  name: "dem_conv4_3_bn_sc1"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}


#######################

layer {
  bottom: "conv4_3_sc1"
  top: "conv4_3_sc1"
  name: "relu4_3_sc1"
  type: "ReLU"
}

layer {
  bottom: "dem_conv4_3_sc1"
  top: "dem_conv4_3_sc1"
  name: "dem_relu4_3_sc1"
  type: "ReLU"
}


######################

layer {
  name: "pool4_drop_sc1"
  type: "Dropout"
  bottom: "conv4_3_sc1"
  top: "conv4_3_sc1"
  dropout_param {
    dropout_ratio: 0.2
  }
}

layer {
  bottom: "conv4_3_sc1"
  top: "pool4_sc1"
  top: "pool4_mask_sc1"
  name: "pool4_sc1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}


######################

layer {
  name: "dem_pool4_drop_sc1"
  type: "Dropout"
  bottom: "dem_conv4_3_sc1"
  top: "dem_conv4_3_sc1"
  dropout_param {
    dropout_ratio: 0.2
  }
}

layer {
  bottom: "dem_conv4_3_sc1"
  top: "dem_pool4_sc1"
  top: "dem_pool4_mask_sc1"
  name: "dem_pool4_sc1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}


######################

layer {
  bottom: "pool4_sc1"
  top: "conv5_1_sc1"
  name: "conv5_1_sc1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}

layer {
  bottom: "conv5_1_sc1"
  top: "conv5_1_sc1"
  name: "conv5_1_bn_sc1"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}

layer {
  bottom: "dem_pool4_sc1"
  top: "dem_conv5_1_sc1"
  name: "dem_conv5_1_sc1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}

layer {
  bottom: "dem_conv5_1_sc1"
  top: "dem_conv5_1_sc1"
  name: "dem_conv5_1_bn_sc1"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}

########################

layer {
  bottom: "conv5_1_sc1"
  top: "conv5_1_sc1"
  name: "relu5_1_sc1"
  type: "ReLU"
}

layer {
  bottom: "dem_conv5_1_sc1"
  top: "dem_conv5_1_sc1"
  name: "dem_relu5_1_sc1"
  type: "ReLU"
}

#######################

layer {
  bottom: "conv5_1_sc1"
  top: "conv5_2_sc1"
  name: "conv5_2_sc1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}

layer {
  bottom: "conv5_2_sc1"
  top: "conv5_2_sc1"
  name: "conv5_2_bn_sc1"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}

layer {
  bottom: "dem_conv5_1_sc1"
  top: "dem_conv5_2_sc1"
  name: "dem_conv5_2_sc1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}

layer {
  bottom: "dem_conv5_2_sc1"
  top: "dem_conv5_2_sc1"
  name: "dem_conv5_2_bn_sc1"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}

##############################

layer {
  bottom: "conv5_2_sc1"
  top: "conv5_2_sc1"
  name: "relu5_2_sc1"
  type: "ReLU"
}


layer {
  bottom: "dem_conv5_2_sc1"
  top: "dem_conv5_2_sc1"
  name: "dem_relu5_2_sc1"
  type: "ReLU"
}

#############################

layer {
  bottom: "conv5_2_sc1"
  top: "conv5_3_sc1"
  name: "conv5_3_sc1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}

layer {
  bottom: "conv5_3_sc1"
  top: "conv5_3_sc1"
  name: "conv5_3_bn_sc1"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}

layer {
  bottom: "dem_conv5_2_sc1"
  top: "dem_conv5_3_sc1"
  name: "dem_conv5_3_sc1"
